In [10]:
#import Library
import pandas as pd

In [11]:
#load dataset
df = pd.read_csv('3098329-data (1)/cars.csv')
df

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8.0,307.0,130.0,3504,12.0,70,US
1,Buick Skylark 320,15.0,8.0,350.0,165.0,3693,11.5,70,US
2,Plymouth Satellite,18.0,8.0,318.0,150.0,3436,NaN,70,US
3,AMC Rebel SST,16.0,8.0,304.0,150.0,3433,12.0,70,US
4,Ford Torino,17.0,8.0,302.0,140.0,3449,10.5,70,US
...,...,...,...,...,...,...,...,...,...
401,Ford Mustang GL,27.0,4.0,140.0,86.0,2790,15.6,82,US
402,Volkswagen Pickup,44.0,4.0,97.0,52.0,2130,24.6,82,Europe
403,Dodge Rampage,32.0,4.0,135.0,84.0,2295,11.6,82,US
404,Ford Ranger,28.0,4.0,120.0,79.0,2625,18.6,82,US
405,Chevy S-10,31.0,4.0,119.0,82.0,2720,19.4,82,US

In [12]:
#values and count
df['Origin'].unique()

array(['US', 'Europe', 'Japan'], dtype=object)

In [13]:
df['Origin'].nunique()

3

In [14]:
#get values
df.loc[3, 'Car']

'AMC Rebel SST'

In [15]:
#Get cell value using Index
df.iloc[3, 0]

'AMC Rebel SST'

In [16]:
#set value
df.loc[3, 'car']= 'My Car'
df.head()

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin,car
0,Chevrolet Chevelle Malibu,18.0,8.0,307.0,130.0,3504,12.0,70,US,NaN
1,Buick Skylark 320,15.0,8.0,350.0,165.0,3693,11.5,70,US,NaN
2,Plymouth Satellite,18.0,8.0,318.0,150.0,3436,NaN,70,US,NaN
3,AMC Rebel SST,16.0,8.0,304.0,150.0,3433,12.0,70,US,My Car
4,Ford Torino,17.0,8.0,302.0,140.0,3449,10.5,70,US,NaN

In [17]:
#Get continuous range of values
df.loc[3:5, 'Car']

3       AMC Rebel SST
4         Ford Torino
5    Ford Galaxie 500
Name: Car, dtype: object

In [18]:
#Get Continuous Range
df.loc[3:5, 'Displacement':'Weight']

   Displacement  Horsepower  Weight
3         304.0       150.0    3433
4         302.0       140.0    3449
5         429.0       198.0    4341

In [19]:
#Get Intermittent Values
#Get first and 4th index of Car Name 
df.loc[[1,4], 'Car']

1    Buick Skylark 320
4          Ford Torino
Name: Car, dtype: object

In [20]:
df.loc[[1,4],['Car','Weight']]

                 Car  Weight
1  Buick Skylark 320    3693
4        Ford Torino    3449